## Plan Result (sbox-genesis)




<pre><code>Plan: 5 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.genesis.azurerm_key_vault.key_vault
  * module.genesis.azurerm_key_vault_access_policy.developers_group_access_policy
  * module.genesis.azurerm_key_vault_access_policy.key_vault_access_policy
  * module.genesis.azurerm_key_vault_access_policy.ops_group_access_policy
  * module.genesis.azurerm_key_vault_access_policy.platform_operations
* Update
  * module.genesis.azurerm_resource_group.genesis_resource_group




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.genesis.azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "dtssharedservicessboxkv"
      + public_network_access_enabled   = true
      + resource_group_name             = "genesis-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 30
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)
    }

  # module.genesis.azurerm_key_vault_access_policy.developers_group_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "developers_group_access_policy" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Encrypt",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
      + secret_permissions = [
          + "List",
          + "Set",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.genesis.azurerm_key_vault_access_policy.key_vault_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "key_vault_access_policy" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Create",
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = "18100ccb-fb74-4790-b836-4454445b56cb"
      + secret_permissions = [
          + "Backup",
          + "Delete",
          + "Get",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Set",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.genesis.azurerm_key_vault_access_policy.ops_group_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "ops_group_access_policy" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
        ]
      + key_vault_id       = (known after apply)
      + object_id          = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
      + secret_permissions = [
          + "Backup",
          + "Delete",
          + "Get",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Set",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.genesis.azurerm_key_vault_access_policy.platform_operations will be created
  + resource "azurerm_key_vault_access_policy" "platform_operations" {
      + certificate_permissions = [
          + "Backup",
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "ManageContacts",
          + "ManageIssuers",
          + "Recover",
          + "Restore",
          + "SetIssuers",
          + "Update",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "Delete",
          + "Encrypt",
          + "Decrypt",
          + "Get",
          + "Import",
          + "List",
          + "Recover",
          + "Restore",
          + "Update",
          + "Backup",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + secret_permissions      = [
          + "Backup",
          + "Delete",
          + "Get",
          + "List",
          + "Recover",
          + "Restore",
          + "Set",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.genesis.azurerm_resource_group.genesis_resource_group will be updated in-place
  ~ resource "azurerm_resource_group" "genesis_resource_group" {
        id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg"
        name     = "genesis-rg"
      ~ tags     = {
            "application"  = "core"
          ~ "builtFrom"    = "hmcts/aks-sds-deploy" -> "hmcts/aks-cft-deploy"
          ~ "businessArea" = "Cross-Cutting" -> "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.genesis.azurerm_key_vault.key_vault has been deleted
  - resource "azurerm_key_vault" "key_vault" {
      - id                              = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappssboxkv" -> null
        name                            = "dcdcftappssboxkv"
        tags                            = {
            "application"  = "core"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":457,"Program":"tfcmt","SHA1":"","Target":"sbox-genesis","Vars":{}} -->